




const dependences = [



	// масиви-списки з інших сайтів ( сторонні ) ----------------------------------------------------------------------------------
	
	{ db: 'country' 	, },  // https://pillypenkosa.github.io/database/list/list.country.js





	// масиви-списки з ЦЬОГО проекту ( свої ) -------------------------------------------------------------------------------------

	{ arr: 'pc.vga' 			, },
	{ arr: 'pc.my' 				, },




	// компоненти загальні --------------------------------------------------------------------------------------------------------





	{ cmp: 'Win-Err404' 			, },
	{ cmp: 'Footer' 				, },
	{ cmp: 'Menu' 					, },
	{ cmp: 'Header' 				, },

	{ cmp: 'Logo' 					, },

	{ cmp: 'Spoyler' 				, },






	// компоненти-контенти // win-сторiнки ----------------------------------------------------------------------------------------
	


	{ cmp: 'Win-Vga' 				, regexp: /^vga/ 						, },
	{ cmp: 'Win-MyPc' 				, regexp: /^my-pc/ 						, },

	{ cmp: 'Win-Index' 				, regexp: /^index$/ 					, }, 	// regexp - url-маршрут (route) в адресному рядку
	






	//{ cmp: 'Win-User' 			, regexp: /^user\/[0-9]+$/ 				, }, 	// user/{ n }
	//{ cmp: 'Win-User' 			, regexp: /^user\/[0-9A-Za-z]+$/ 		, }, 	// user/{ txt }
	//{ cmp: 'Win-Users' 			, regexp: /^users$/ 					, },










];




















